In [1]:
import pandas as pd

# Creating a DataFrame
data = {
    'EmployeeID': [101, 102, 103, 104],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [23, 45, 30, 35],
    'Department': ['HR', 'IT', 'Finance', 'IT'],
    'Salary': [50000, 80000, 60000, 75000]
}

df = pd.DataFrame(data)
print(df)

   EmployeeID     Name  Age Department  Salary
0         101    Alice   23         HR   50000
1         102      Bob   45         IT   80000
2         103  Charlie   30    Finance   60000
3         104    David   35         IT   75000

In [5]:
df['Age'] * 6

0    138
1    270
2    180
3    210
Name: Age, dtype: int64

In [9]:
df[df['Department'] =='IT']

   EmployeeID   Name  Age Department  Salary
1         102    Bob   45         IT   80000
3         104  David   35         IT   75000

In [10]:
df.sort_values(by='Salary', ascending=False)

   EmployeeID     Name  Age Department  Salary
1         102      Bob   45         IT   80000
3         104    David   35         IT   75000
2         103  Charlie   30    Finance   60000
0         101    Alice   23         HR   50000

In [14]:
df.groupby('Department')['Salary'].sum()

Department
Finance     60000
HR          50000
IT         155000
Name: Salary, dtype: int64

In [19]:
df[df['Salary'] == df['Salary'].max()]

   EmployeeID     Name  Age Department  Salary
0         101    Alice   23         HR   80000
1         102      Bob   45         IT   80000
2         103  Charlie   30    Finance   80000
3         104    David   35         IT   80000

In [23]:
df[df['Age'] > 30]

   EmployeeID   Name  Age Department  Salary
1         102    Bob   45         IT   80000
3         104  David   35         IT   80000

In [29]:
def deco(func):
    def inner(*args, **kwargs):
        print ("hi")
        result = func(*args, **kwargs)
        return result
        
    return inner

@deco
@deco
def sum():
    return 10
sum()

hi
hi

10

In [30]:
df

   EmployeeID     Name  Age Department  Salary
0         101    Alice   23         HR   80000
1         102      Bob   45         IT   80000
2         103  Charlie   30    Finance   80000
3         104    David   35         IT   80000

In [32]:
df.apply(lambda x: x > 20)

TypeError: ("'>' not supported between instances of 'str' and 'int'", 'occurred at index Name')